2026-03-22-why-i-love-nixos.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="description" content="Why I love NixOS is really about the Nix package manager, reproducibility, and sane system management in the LLM coding era.">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.birkey.co/rss.xml"
      title="RSS feed for https://www.birkey.co/">
<title>Why I love NixOS</title>
<link href="static/style.css" rel="stylesheet" type="text/css" />
	   <link rel="apple-touch-icon" sizes="180x180" href="static/apple-touch-icon.png">
	   <link rel="icon" type="image/png" sizes="32x32" href="static/favicon-32x32.png">
	   <link rel="icon" type="image/png" sizes="16x16" href="static/favicon-16x16.png">
	   <link rel="manifest" href="/site.webmanifest">
	   <link rel="mask-icon" href="static/safari-pinned-tab.svg" color="#5bbad5">
	   <link rel="alternate" type="application/rss+xml" title="RSS Feed for birkey.co" href="/rss.xml">
	   <meta name="author" content="Kasim Tuman">
	   <meta name="referrer" content="no-referrer">
	   <meta name="msapplication-TileColor" content="#da532c">
	   <meta name="theme-color" content="#ffffff">
	   <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
	   <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
	  </head>
<body>
<div id="preamble" class="status"><br><center>
       <div style="display: inline-block; vertical-align:middle;">
  <a href="https://www.birkey.co/index.html" style="text-decoration: none;"><b>BIRKEY CONSULTING</b><br>
  </a><hr/><div style="text-align: justify;display: inline-block; width: 100%;">
<a class="title" href="https://github.com/oneness">ABOUT</a> &nbsp;<a class="title" href="https://www.birkey.co/rss.xml">RSS</a> &nbsp;<a class="title" href="https://www.birkey.co/archive.html">ARCHIVE</a></div></div>
  </center><br><br>
  <div style="margin-bottom: 3ch;text-transform: none;"></div></div>
<div id="content">
<div class="post-date">22 Mar 2026</div><h1 class="post-title"><a href="https://www.birkey.co/2026-03-22-why-i-love-nixos.html">Why I love NixOS</a></h1>
<p>
What I love about NixOS has less to do with Linux and more to do
with the <a href="https://nix.dev/manual/nix/latest/package-management/">Nix package manager</a><sup><a id="fnr.getting-started" class="footref" href="#fn.getting-started" role="doc-backlink">1</a></sup>.
</p>

<p>
To me, NixOS is the operating system artifact of a much more important
idea: a deterministic and reproducible functional package
manager. That is the core of why I love NixOS. It is not distro
branding that I care about. It is the fact that I can construct a
whole operating system as a deterministic result of feeding Nix DSL to
Nix and then rebuild it, change it bit by bit, and roll it back if I
do not like the result.
</p>

<p>
I love NixOS because most operating systems slowly turn
into a pile of state. You install packages, tweak settings, try random
tools, remove some of them, upgrade over time and after a while you
have a machine that works but not in a way that you can confidently
explain from first principles. NixOS felt very different to me. I do
not have to trust a pile of state. I can define a system and build it.
</p>

<p>
I love NixOS because I can specify the whole OS
including the packages I need and the configuration in one
declarative setup. That one place aspect matters to
me more than it might sound at first. I do not have to chase package
choices in one place, desktop settings in another place and keyboard
behavior somewhere else. Below are a couple of small Nix DSL examples.
</p>

<ul class="org-ul">
<li>GNOME extensions:</li>
</ul>

<div class="org-src-container">
<pre class="src src-nix">environment.systemPackages = with pkgs; [
  gnomeExtensions.dash-to-dock
  gnomeExtensions.unite
  gnomeExtensions.appindicator
  libappindicator
];

services.desktopManager.gnome.extraGSettingsOverrides = ''
  [org.gnome.shell]
  enabled-extensions=['dash-to-dock@gnome-shell-extensions.gcampax.github.com', 'unite@hardpixel.eu', 'appindicatorsupport@rgcjonas.gmail.com']

  [org.gnome.shell.extensions.dash-to-dock]
  dock-position='BOTTOM'
  autohide=true
  dock-fixed=false
  extend-height=false
  transparency-mode='FIX'
'';
</pre>
</div>

<ul class="org-ul">
<li>Key mapping per keyboard:</li>
</ul>

<div class="org-src-container">
<pre class="src src-nix">services.keyd = {
  enable = true;

  keyboards = {
    usb_keyboard = {
      ids = [ "usb:kb" ];
      settings.main = {
        leftcontrol = "leftmeta";
        leftmeta = "leftcontrol";
        rightalt = "rightmeta";
        rightmeta = "rightalt";
      };
    };

    laptop_keyboard = {
      ids = [ "laptop:kb" ];
      settings.main = swapLeftAltLeftControl;
    };
  };
};
</pre>
</div>

<p>
Those are ordinary details of a working machine, but that is exactly
the point. I can describe them declaratively, rebuild the system and
keep moving. If I buy a new computer, I do not have to remember a long
chain of manual setup steps or half-baked scripts scattered all over. I
can rebuild the system from a single source of truth.
</p>

<p>
I love NixOS because it has been around for a long
time. In my experience, it has been very stable. It has a predictable release
cadence every six months. I can set it up to update automatically and
upgrade it without the usual fear that tends to come with operating
system upgrades. I do not have to think much about upgrade prompts,
desktop notifications or random system drift in the background. It
mostly stays out of my way. And if I want to be more adventurous, it
also has an unstable channel<sup><a id="fnr.unstable-channel" class="footref" href="#fn.unstable-channel" role="doc-backlink">2</a></sup> that I can enable to experiment and get
newer software.
</p>

<p>
I love NixOS because it lets my laptop
be boring in the best possible sense. I recently bought an HP laptop<sup><a id="fnr.hp-laptop" class="footref" href="#fn.hp-laptop" role="doc-backlink">3</a></sup>
and NixOS worked beautifully on it out of the box. I did not have to
fight the hardware to get to a reasonable
baseline. That gave me exactly what I want from a personal computer: a
stable system that I can configure declaratively and then mostly
ignore while I focus on actual work.
</p>

<p>
I love NixOS because it makes experimentation cheap and safe. I
can try packages without mutating the base system. I can construct a
completely isolated package shell<sup><a id="fnr.nix-develop" class="footref" href="#fn.nix-develop" role="doc-backlink">4</a></sup> for anything from a one-off script
to a full-blown project. If I want to harden it further, I can use the
Nix DSL to specify the dependencies, build steps and resulting
artifacts declaratively. That is a much better way to work than
slowly polluting my daily driver and hoping I can reconstruct what I did
later.
</p>

<p>
I love NixOS because I can use the same package manager across macOS
and Linux. There is also community-maintained support for FreeBSD,
though I have not used it personally. That is a huge practical benefit
because my development tooling and dependency management can stay
mostly uniform across those systems. It means the value of Nix is not
tied only to NixOS. NixOS happens to be the most complete expression
of it, but the underlying model is useful to me across platforms.
</p>

<p>
I love NixOS because it fits especially well with the way I work in the
current LLM coding era.
</p>

<p>
Tools are changing very quickly. Coding agents often need very
specific versions of utilities, compilers and runtimes. They need to
install something, use it, throw it away, try another version and keep
going without turning my PC into a garbage dump of conflicting
state. Nix fits that model naturally. If I tell a coding agent that I
use Nix, it is usually clever enough to reach for <code>nix shell</code> or
<code>nix develop</code> to bring the needed tool into an isolated environment
and execute it there. That is especially handy because Nix treats
tooling as a declared input instead of an accidental side effect on
the system.
</p>

<p>
A concrete example: I recently built a voice-to-text agent in
Rust<sup><a id="fnr.voice-agent" class="footref" href="#fn.voice-agent" role="doc-backlink">5</a></sup>. I did not have the Rust toolchain installed on my system. I
simply told the coding agent that I use Nix, and it figured out how
to pull in the entire Rust toolchain through Nix, compile the project
inside an isolated shell and produce a working binary. My base system
was never touched. No <code>~/.cargo</code>, no <code>~/.rustup</code>, no mutated PATH
entries left behind. Without Nix, the agent would have reached for
<code>curl | sh</code> to install rustup, quietly mutated my environment and
left my system slightly different forever. With Nix, none of that
happened.
</p>

<p>
This pattern generalizes. Every time an agent needs Python 3.11 vs
3.12, a specific version of <code>ffmpeg</code>, an obscure CLI tool or a
particular compiler, Nix gives it a clean and reversible way to get
exactly what it needs. The agent does not have to guess whether a
tool is already installed or in the wrong version. It just declares
what it needs and Nix takes care of the rest in a sandboxed way.
</p>

<p>
The other thing I appreciate is that Nix turns an agent's
experiment into something you can actually commit and reproduce. Once
the agent has a working setup, you can capture the exact dependencies
in a <code>flake.nix</code> and run <code>nix flake check</code> to verify it builds
cleanly from scratch. That transforms an ad hoc agent session into a
reproducible, verifiable artifact. That is a much stronger foundation
for delivering something that works reliably in production than hoping
the environment happens to be in the right shape on the next
machine.
</p>

<p>
I love NixOS because I like what Nix gives me in deployment too. I
have never been a big fan of Docker as the final answer to the "works
on my machine" problem. It solved important problems for the industry,
no doubt about that, but I always found the overall model less
satisfying than a truly deterministic one. Nix gives me a much better
story. I can use <a href="https://nixos.org/manual/nixpkgs/stable/#ssec-pkgs-dockerTools-buildLayeredImage">dockerTools.buildLayeredImage</a> to build smaller Docker
images in a deterministic and layered approach. If I can build it on
one computer with the proper configuration, I can build the same
artifact on another one as long as Nix supports the architecture,
which in my experience has been very reliable.
</p>

<p>
That coherence is one of the things I value most about NixOS. The same
underlying model helps me with my laptop, my shell, my project
dependencies, my CI pipeline and my deployment artifact. It is one
way of thinking about software instead of a loose collection of
unrelated tools and habits.
</p>

<p>
So when I say I love NixOS, what I really mean is that I love what it
represents. I love a system that is declarative, reproducible,
reversible and stable. I love being able to experiment without fear
and upgrade without drama. I love that it helps me focus on building
and experimenting with fast-moving tools, including LLM coding
agents, without worrying about messing up my system in the process.
</p>

<p>
I love NixOS because it is the most complete everyday expression of
what I think software systems should be.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.getting-started" class="footnum" href="#fnr.getting-started" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
If you are new to Nix, I wrote a more practical
getting-started guide here:
<a href="https://www.birkey.co/2025-04-15-nix:-better-way-for-fun-and-profit.html">Nix: Better way for fun and profit</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.unstable-channel" class="footnum" href="#fnr.unstable-channel" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
By unstable channel I mean the official
`nixos-unstable` or `nixpkgs-unstable` channels. See
<a href="https://wiki.nixos.org/wiki/Channel_branches">Channel branches</a>
and <a href="https://channels.nixos.org">channels.nixos.org</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.hp-laptop" class="footnum" href="#fnr.hp-laptop" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
HP EliteBook X G1a 14 inch Notebook with 64 GiB RAM and
AMD Ryzen AI 9 HX PRO 375.
</p></div></div>

<div class="footdef"><sup><a id="fn.nix-develop" class="footnum" href="#fnr.nix-develop" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
For example,
<a href="https://nix.dev/manual/nix/2.26/command-ref/new-cli/nix3-develop">nix develop</a>
drops you into an interactive shell environment that is very close to
what Nix would use to build the current package or project.
</p></div></div>

<div class="footdef"><sup><a id="fn.voice-agent" class="footnum" href="#fnr.voice-agent" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
A voice-to-text agent I built in Rust that replaced
Whisper and Willow Voice in my personal workflow. I wrote it first for
macOS and then ported it to Linux. I have been using it as a daily
driver for a couple of months now. I am considering open sourcing it
or releasing it as a standalone app.
</p></div></div>


</div>
</div><div class="taglist"><a href="https://www.birkey.co/tags.html">Tags</a>: <a href="https://www.birkey.co/tag-nix.html">nix</a> <a href="https://www.birkey.co/tag-ai.html">ai</a> </div></div>
<div id="postamble" class="status"><br><center>
	      <div style="display: inline-block; vertical-align:middle;"></div></div>
</body>
</html>
